{
  "American Shorthair": "The American Shorthair is a breed with a recognizable personality and behavior profile. They are generally well-loved for their unique temperament and charm. Owners often mention behaviors such as being energetic.",
  "British Shorthair": "The British Shorthair is a breed with a recognizable personality and behavior profile. They are generally well-loved for their unique temperament and charm. Owners often mention behaviors such as being biting.",
  "Calico": "The Calico is a breed with a recognizable personality and behavior profile. They are known for being affectionate and may enjoy cuddling. They can be quite vocal and expressive. Owners often mention behaviors such as being friendly, biting.",
  "Domestic Long Hair": "The Domestic Long Hair is a breed with a recognizable personality and behavior profile. They are known for being affectionate and may enjoy cuddling. They can be quite vocal and expressive. Owners often mention behaviors such as being energetic, friendly.",
  "Domestic Medium Hair": "The Domestic Medium Hair is a breed with a recognizable personality and behavior profile. They are generally well-loved for their unique temperament and charm. They are also known for adapting well to different households.",
  "Domestic Short Hair": "The Domestic Short Hair is a breed with a recognizable personality and behavior profile. Some individuals may be shy or cautious in new environments. They are also known for adapting well to different households.",
  "Maine Coon": "The Maine Coon is a breed with a recognizable personality and behavior profile. They are known for being affectionate and may enjoy cuddling. Some individuals may be shy or cautious in new environments. Owners often mention behaviors such as being territorial.",
  "Persian": "The Persian is a breed with a recognizable personality and behavior profile. They can be quite vocal and expressive. They form strong bonds with their favorite humans. They are also known for adapting well to different households.",
  "Siamese": "The Siamese is a breed with a recognizable personality and behavior profile. They are playful and enjoy engaging with toys. Owners often mention behaviors such as being energetic.",
  "Tabby": "The Tabby is a breed with a recognizable personality and behavior profile. They are known for being affectionate and may enjoy cuddling. Some individuals may be shy or cautious in new environments. Owners often mention behaviors such as being biting.",
  "Tortoiseshell": "The Tortoiseshell is a breed with a recognizable personality and behavior profile. They can be quite vocal and expressive. They are also known for adapting well to different households.",
  "Tuxedo": "The Tuxedo is a breed with a recognizable personality and behavior profile. They are generally well-loved for their unique temperament and charm. Owners often mention behaviors such as being gentle, biting."
}
